{
  "Веб-приложение": "Приложение, предоставляющее функциональные возможности пользователю через браузер или другой тип агента пользователя, использующего веб-форматы и протоколы.",
  "Язык программирования": "Формальный язык, предназначенный для записи компьютерных программ. Он определяет набор лексических, синтаксических и семантических правил, управляя внешним видом программы и её действиями.",
  "Тестирование программного обеспечения": "Процесс исследования и испытания программного продукта для проверки соответствия между реальным поведением программы и её ожидаемым поведением на тестах.",
  "Контейнеризация": "Метод виртуализации, при котором ядро операционной системы поддерживает изолированные экземпляры пространства пользователя вместо одного. Эти экземпляры, обычно называемые контейнерами или зонами, с точки зрения выполняемых в них процессов идентичны отдельному экземпляру операционной системы.",
  "Docker": "Открытая платформа для автоматизации развертывания приложений в легковесных, поддерживаемых контейнерах. Контейнеры обеспечивают изолированные и переносимые окружения, включая приложение, зависимости и системные библиотеки.",
  "Docker Hub": "Служба реестра Docker, применяемая для поиска образов контейнеров, а также предоставления ограниченного (для разработчиков) или общего доступа к этим образам. Docker Hub по функциональности похож на GitHub.",
  "Node.js": "Среда выполнения JavaScript на стороне сервера, построенная на движке V8 от Google. Она обеспечивает высокую производительность благодаря асинхронной модели ввода/вывода.",
  "GitHub Actions": "Интегрированный веб-сервис для создания, тестирования и развертывания кода непосредственно из репозитория GitHub.",
  "CI/CD": "Серия автоматизированных рабочих процессов, которые помогают командам DevOps сократить количество ручных задач.",
  "Apache Benchmark": "Инструмент для тестирования производительности веб-серверов, разработанный Apache Software Foundation. Позволяет отправлять большое количество запросов на веб-сервер и измерять его производительность.",
  "Контейнерная оркестрация": "Управление, автоматизация и масштабирование развертывания контейнеризованных приложений, обеспечивая их эффективное взаимодействие.",
  "Selenium": "Инструмент для автоматизации тестирования веб-приложений. Поддерживает взаимодействие с браузерами, эмулируя действия пользователя.",
  "Unit-тестирование веб-приложений": "Тестирование отдельных компонентов веб-приложения для проверки их изолированного функционирования.",
  "Контейнеризация баз данных": "Упаковка и изоляция баз данных в контейнеры для облегчения развертывания и масштабирования веб-приложений.",
  "RESTful API тестирование": "Проверка корректности и эффективности веб-приложений, использующих RESTful API для взаимодействия с клиентами.",
  "Docker Swarm": "Инструмент для управления кластером Docker-хостов и автоматизации развертывания контейнеров в масштабе.",
  "Мониторинг контейнеров": "Слежение за состоянием и производительностью контейнеров в реальном времени для обеспечения их стабильной работы.",
  "Кросс-браузерное тестирование": "Проверка совместимости веб-приложений с разными браузерами, включая контейнеризованные среды.",
  "Jenkins": "Инструмент для автоматизации процессов интеграции и развертывания веб-приложений, включая тестирование в контейнерах.",
  "Масштабирование веб-приложений": "Процесс увеличения ресурсов и производительности веб-приложения с ростом нагрузки, включая работу в контейнерах.",
  "Контейнерные сети": "Изоляция сетевого взаимодействия между контейнерами и веб-приложениями в контейнеризованных средах.",
  "Тестирование безопасности веб-приложений": "Проверка наличия уязвимостей и обеспечение безопасности веб-приложений в условиях использования контейнеров.",
  "Kubernetes": "Система для автоматизации развертывания, масштабирования и управления контейнеризированными приложениями.",
  "Load testing веб-приложений": "Проверка производительности веб-приложений под высокой нагрузкой для определения их способности обработки больших объемов запросов.",
  "Cypress": "Фреймворк для автоматизированного тестирования веб-приложений, предоставляющий инструменты для создания эффективных тестов в контейнеризованных средах.",
  "GitLab CI/CD": "Интегрированный сервис непрерывной интеграции и развертывания от GitLab, обеспечивающий автоматизацию тестирования и доставки кода.",
  "Тестирование производительности": "Оценка способности веб-приложения обеспечивать стабильную работу и высокую производительность при различных условиях использования.",
  "Оркестрация микросервисов": "Управление и координация развертывания, масштабирования и обновления микросервисов в контейнеризованных средах.",
  "Обратное тестирование": "Проверка стойкости веб-приложения при откате изменений, включая восстановление до предыдущих версий контейнеров.",
  "Стресс-тестирование": "Тестирование веб-приложений с целью определения пределов их нагрузочной устойчивости и выявления возможных проблем при перегрузке.",
  "Knative": "Сервис, предоставляющий абстракцию для работы с контейнерами и серверлесс-компонентами в облаке, упрощая развертывание и управление приложениями.",
  "Тестирование масштабирования": "Проверка способности веб-приложения эффективно масштабироваться в условиях изменяющейся нагрузки.",
  "Проверка целостности контейнеров": "Тестирование наличия и правильности зависимостей в контейнерах для обеспечения их правильной работы.",
  "Основные принципы CI/CD": "Принципы непрерывной интеграции и развертывания, включая автоматизацию процессов сборки, тестирования и доставки кода.",
  "Тестирование совместимости": "Проверка взаимодействия веб-приложения с различными окружениями и конфигурациями контейнеров.",
  "Prometheus": "Открытый инструмент мониторинга и алертинга, активно используемый для отслеживания производительности контейнеризированных приложений.",
  "Тестирование отказоустойчивости": "Проверка способности веб-приложения работать стабильно при сбоях и неполадках в контейнеризованных условиях.",
  "Continuous Testing": "Автоматизированный подход к тестированию в рамках CI/CD, обеспечивающий постоянную проверку кода на всех этапах разработки.",
  "Функциональное тестирование веб-приложений": "Проверка функциональных возможностей веб-приложения в контейнеризованной среде.",
  "ArgoCD": "Инструмент управления развертыванием приложений в Kubernetes, обеспечивающий автоматизированный процесс CI/CD.",
  "Тестирование масштабируемости": "Оценка возможности веб-приложения эффективно масштабироваться при увеличении объема данных и нагрузки.",
  "Istio": "Сервис сетевого управления для микросервисных приложений в контейнеризированных средах, предоставляющий возможности трафик-менеджмента и мониторинга.",
  "Тестирование на устойчивость": "Проверка устойчивости веб-приложения при долгосрочной нагрузке и в различных условиях работы с контейнерами.",
  "Fluentd": "Открытый сборщик и пересылатель данных для еффективного сбора и отправки логов из контейнеризированных приложений."
}